import {IQuizQuestion} from "../../quizRunner";

export const DATA:()=>IQuizQuestion[] = ()=> [
    {
        text: 'Ім\'я якої казкової героїні походить від одиниці вимірювання довжини?',
        answers: [
            {text: 'Дюймовочка', correct: true},
            {text: 'Сантиметровочка'},
            {text: 'Кілометровочка'},
            {text: 'Стометровочка'}
        ],
        level: 0
    },
    {
        text: 'Який математичний закон, відомий всім ще з молодших класів, став популярним прислів\'ям?',
        answers: [
            {text: 'Від перестановки доданків сума не змінюється', correct: true},
            {text: 'Квадратний корінь від нуля - нуль'},
            {text: 'У квадрата всі сторони рівні'},
            {text: 'На нуль ділити не можна'}
        ],
        level: 0
    },
    {
        text: 'Операція, обернена до операції множення',
        answers: [
            {text: 'Ділення', correct: true},
            {text: 'Додавання'},
            {text: 'Віднімання'},
            {text: 'Піднесення до ступеню'}
        ],
        level: 0
    },
    {
        text: 'Як називається кут, що дорівнює 90 градусів',
        answers: [
            {text: 'Прямий', correct: true},
            {text: 'Правильний'},
            {text: 'Рівний'},
            {text: 'Крутий'}
        ],
        level: 0
    },
]
